[
  {
    "id": "623853b2614ad5aba311fdd1",
    "description": "This book, as the author states in the introduction, was written to fulfill a need that the author had for a single-volume Islamic history which could be taught to his students, many of whom were second-generation immigrants at te Darul Qasim school in Chicago. ",
    "rating": "5",
    "picture": "https://www.amazon.com/avatar/default/amzn1.account.AEHQNVWD4GBTE6VOM6Y7JE52SY2Q?square=true&max_width=460",
    "name": "Casey W"
  },
  {
    "id": "623853b2578e9e6ad1ae0dd5",
   "description": "This is the clearest book I've ever read so far on the history of Islam. It is focused, it has a clear timeline, and it is very concise, with no distracting facts that are irrelevant with the narrative. It is detailed enough, but without being complicated.",
    "rating": "5",
    "picture": "https://www.amazon.com/avatar/default/amzn1.account.AGOLAXQQXALDEIXLJRQUW2DD7NDQ?square=true&max_width=460",
    "name": "edsetiadi"
  },
  {
    "id": "623853b21fb149d2ee7b76c7",
    "description": "I swear, I have never been this addicted to a book in my entire life. I read the first 100 pages in one sitting, if you want to know more about Muslim Civilization and History. Look no further!",
     "rating": "4",
    "picture": "https://www.amazon.com/avatar/default/amzn1.account.AFQHZ5VJRA3J56BMGJ4JHRI3DTBA?square=true&max_width=460",
    "name": "Christophe Dawson"
  },
  {
    "id": "623853b2e91c8de578c9245e",
     "description": "The book was well research and very informative. Actually this book should be read by every Muslim person to understand the history of Muslim world.",
      "rating": "5",
    "picture": "https://www.amazon.com/avatar/default/amzn1.account.AG327ESLVJZAMINYV7VTHI42NVPQ?square=true&max_width=460",
    "name": "Abdul"
  },
   {
    "id": "623853b2e91c8de578c9455e",
     "description": "Aside from the few shia bias from the author (I'm Sunni btw but I want to believe I have no issues with Shias lol) and the unclear stand to me of the author on the founder of Wahabism, the book is a must read. To understand the world of today.",
      "rating": "4",
    "picture": "https://www.amazon.com/avatar/default/amzn1.account.AG327ESLVJZAMINYV7VTHI42NVPQ?square=true&max_width=460",
    "name": "Papatia Feauxzar"
  },
   {
    "id": "623853b2e91c8de578ce9245e",
     "description": "It is impossible to write a book about the history of Muslim peoples that is accurate, gives necessary information without name/date overload but still covers areas as far flung as Spain and China - and still make it short enough and interesting enough that youth will read it.",
      "rating": "5",
    "picture": "https://www.amazon.com/avatar/default/amzn1.account.AG327ESLVJZAMINYV7VTHI42NVPQ?square=true&max_width=460",
    "name": "Ramazan Ali"
  }
  
]